import json

from src.services import service_search


def test_service_search(list_dict):
    """тест на корректность фильтрации по категории"""

    result = service_search(list_dict, "супермаркеты")
    expected = [
        {
            "Бонусы (включая кэшбэк)": 0,
            "Валюта операции": "RUB",
            "Валюта платежа": "RUB",
            "Дата операции": "12.11.2021 18:37:13",
            "Дата платежа": "12.11.2021",
            "Категория": "Супермаркеты",
            "Округление на инвесткопилку": 0,
            "Описание": "Магнит",
            "Статус": "OK",
            "Сумма операции": -2236.28,
            "Сумма операции с округлением": 2236.28,
            "Сумма платежа": -2236.28,
        }
    ]
    result_list = json.loads(result)

    assert result_list == expected
